#int表示纯数字
#str表示字符串
#print()函数打印变量
#type()显示变量类型
a= 1234568
print(type(a))
a= "hkasd"
print(type(a))
#list代表一个列表,可以存多个数据,数据中用","隔开
b=[1,2,3,4]
print(type(b))
#()tuplt代表一个元祖,可以存多个数据,数据中用","隔开
c=(1,2,3,4)
print(type(c))
#键值对数据 姓名:邵建南 ,手机号:18896521520 , 性别:男
#{}大括号表示dict 代表一个字典,可以存储多个键值对数据,多个键值对中间用","隔开,key 和 value 之间用: 隔开
d={"姓名":"邵建南","手机号":"18896521520","性别":"男"}
print(type(d))
print(d)
#练习
# 第一组数据   张三,李四,王五,赵六,钱七   f1
# 第二组数据    姓名 张三  年龄 18 性别 女  科目 语文 成绩 80 s2
# 第三组数据   A，2,3,4,5,6,7,8,9，J,Q,K t3
# 第四组数据  10000 f4
# 第五组数据  学生 f5
f1=["张三","李四","王五","赵六","钱七"]
print(f1)
print(type(f1))
s2={"姓名":"张三","年龄":18,"性别":"女","科目":"语文","成绩":80}
print(s2)
print(type(s2))
t3=("A",2,3,4,5,6,7,8,9,"J","Q","k")
print(t3)
print(type(t3))
f4=10000
print(f4)
print(type(f4))
f5="学生"
print(f5)
print(type(f5))
